// Напишите метод, который принимает на вход строку (String) и// определяет является ли строка палиндромом (возвращает boolean значение)package org.seminars.seminar2;public class task3 {    public static void main(String[] args) {        System.out.println(isPolindrom("aba"));        System.out.println(isPolindrom("abb"));    }    public static boolean isPolindrom(String str) {        StringBuilder stringBuilder = new StringBuilder(str);        String revered = stringBuilder.reverse().toString();        return str.equals(revered);    }}