// Дано четное число N (>0) и строки c1 и c2, которые следует учитывать как 1 символ.// Написать метод, который вернет строку длины N*2, которая// состоит из чередующихся последовательностей c1 и c2, начиная с c1.package org.seminars.seminar2;public class task1 {    public static void main(String[] args) {        System.out.println(getRepeatStr(3));    }    public static String getRepeatStr(int n) {        String c1 = "c1";        String c2 = "c2";        return (c1 + c2).repeat(n);    }}