//Напишите функцию removeEvenNumbers, которая принимала бы произвольный список целых чисел,//        удаляла бы из него четные числа и выводила список без четных чисел.//        Напишите свой код в методе removeEvenNumbers класса Answer.//        Метод removeEvenNumbers принимает на вход один параметр://        Integer[] arr - список целых чисел//package homeworks.hw3;import java.util.ArrayList;import java.util.List;public class Task2 {    public static void main(String[] args) {        Integer[] arr = new Integer[]{1, 2, 3, 4, 5, 6, 7, 8, 9};        Integer[] arr2 = new Integer[]{-2, -1, 0, 1, 2, 3, 4, 5};        Integer[] arr3 = new Integer[]{2, 4, 6, 8, 9, 10};        removeEvenNumbers(arr);        removeEvenNumbers(arr2);        removeEvenNumbers(arr3);    }    private static void removeEvenNumbers(Integer[] arr) {        List<Integer> arrayList = new ArrayList<>();        for (Integer integer : arr) {            if (integer % 2 != 0) {                arrayList.add(integer);            }        }        System.out.println(arrayList);        // return arrayList;    }}